from pprint import pprint 

car = {('mersedes', 's') : {'price': '2000$', 'двигатель': 3, 'привод': 'задний', 'разгон до 100': 6.2, 'выпуск': 2018, 'страна': 'Германия'}}
cars = []
cars.append(car)

cars_info = [
    {('audi', 's') : {'price': '2000$', 'двигатель': 3, 'привод': 'задний', 'разгон до 100': 6.2, 'выпуск': 2018, 'страна': 'Китай'}},
    {('bmv', 's') : {'price': '3000$', 'двигатель': 4, 'привод': 'передний', 'разгон до 100': 6.2, 'выпуск': 2019, 'страна': 'Европа'}},
    {('ford', 's') : {'price': '4000$', 'двигатель': 5, 'привод': 'задний', 'разгон до 100': 7.2, 'выпуск': 2017, 'страна': 'Европа'}},
    {('bmv x7', 's') : {'price': '5000$', 'двигатель': 6, 'привод': 'задний', 'разгон до 100': 8.2, 'выпуск': 2016, 'страна': 'Европа'}},
    {('bmv x5', 's') : {'price': '6000$', 'двигатель': 7, 'привод': 'задний', 'разгон до 100': 9.2, 'выпуск': 2010, 'страна': 'Европа'}},
    {('bmv x3', 's') : {'price': '7000$', 'двигатель': 8, 'привод': 'задний', 'разгон до 100': 20.2, 'выпуск': 2011, 'страна': 'Европа'}},
    {('bmv x4', 's') : {'price': '8000$', 'двигатель': 9, 'привод': 'передний', 'разгон до 100': 10.2, 'выпуск': 2014, 'страна': 'Европа'}},
    {('bmv x8', 's') : {'price': '1000$', 'двигатель': 10, 'привод': 'задний', 'разгон до 100': 6.2, 'выпуск': 2015, 'страна': 'Европа'}},
    {('kia', 's') : {'price': '9000$', 'двигатель': 2, 'привод': 'задний', 'разгон до 100': 0.2, 'выпуск': 2018, 'страна': 'Китай'}}
]
for car_info in cars_info:
    cars.append(car_info)

cars[0][('mersedes', 's')]['рассрочка'] = True

def filter_cars(cars, param, kriterui):
    filter_car = []
    for car in cars:
        for car_info in car:
            if param in car[car_info]:
                if car[car_info][param] == kriterui:
                    filter_car.append(car_info)
                    
    return filter_car

filter_car = filter_cars(cars, 'выпуск', 2018)
pprint(filter_car)